# python函数传参是传值还是传引用？:https://www.cnblogs.com/loleina/p/5276918.html
# python的参数传递是值传递还是引用传递？都不是！:https://www.cnblogs.com/ljxh/p/11286748.html

# id():id函数可以获得对象的内存地址
# Python 中一切皆为对象，数字是对象，列表是对象，函数也是对象，任何东西都是对象。(Python 中一切皆对象，函数名是函数在内存中的空间，也是一个对象)

#赋值操作的本质就是绑定一个新的对象，对于不可变数据类型，相当于绑定了一个新的对象，所以进行到是值传递的形式，赋值操作完成之后变量引用的对象发生了变化
#结论：
#　　python不允许程序员选择采用传值还是传引用。python参数传递采用的肯定是“传对象引用”的方式。这种方式相当于传值和传引用的一种综合。如果函数收到的是一个不可变对象（数字、字符或元组）的引用，就不能直接修改原始对象 - -相当于通过‘值传递’来传递对象。如果函数收到的是一个可变对象（字典、列表）的引用，就能修改对象的原始值 - -相当于‘传引用’来传递对象。
